{
    "sections": [
        {
            "id": "achievements",
            "type": "content-row",
            "title": "Achievements",
            "items": [
                {
                    "new_popular": "True",
                    "imageSrc": "Images/TUD.png",
                    "title": "TUD Graduation",
                    "year": "2023",
                    "genres": [
                        "Education",
                        "Computer Science",
                        "Software Engineering",
                        "Cloud Computing",
                        "Artificial Intelligence",
                        "Machine Learning"
                    ],
                    "descriptors": [
                        "Inspirational",
                        "Educational",
                        "Technical",
                        "Achievement-Focused",
                        "Academically Rigorous",
                        "Innovative",
                        "Comprehensive",
                        "Future-Oriented"
                    ],
                    "description": "I graduated with a Bachelor of Science (Honours) in Computing, Computer Software Engineering from Technological University Dublin, specializing in Software Development, with additional training in Cloud Computing and AI/Machine Learning.",
                    "episodes": [
                        {
                            "episode_img": "Images/TUD.png",
                            "episode_name": "Year 1: Foundations in Computing and Critical Skills",
                            "episode_description": "The first year focused on building foundational skills across computing disciplines. I learned the basics of software development, computer architecture, and critical skills development. Courses like Software Development 1 and Discrete Mathematics 1 laid the groundwork for problem-solving and programming logic. The inclusion of Visual Design & User Experience and Social Media Communications provided insights into user-centered design and digital communication, while courses like Database Fundamentals and Systems Analysis set the stage for understanding how software systems are planned and structured."
                        },
                        {
                            "episode_img": "Images/TUD.png",
                            "episode_name": "Year 2: Expanding Knowledge in Networking and Software Quality",
                            "episode_description": "The second year introduced more advanced topics in software engineering and network infrastructure. Courses like Software Development 3, Network Fundamentals, and Software Quality Assurance & Testing deepened my knowledge in writing efficient, secure, and maintainable code. The curriculum also introduced web technologies with Client-Side Web Development, while courses such as Advanced Database Technologies enhanced my skills in managing and analyzing data. This year was key in transitioning from theory to practical application, with a focus on networking, information security, and project management."
                        },
                        {
                            "episode_img": "Images/TUD.png",
                            "episode_name": "Year 3: Specialization in Cloud Services, Data Analysis, and Internship",
                            "episode_description": "Year three marked a deeper dive into specialized topics, particularly in cloud computing, data analysis, and distributed systems. In addition to learning about scalable systems and data-driven solutions, I took an elective in Data Analysis, which introduced me to essential concepts in data preparation, statistical description, and model evaluation. The module covered topics like data summarization, hypothesis testing, and relationships between data attributes. The semester also included a hands-on experiential learning module, where I completed a six-month internship with the Department of Social Protection. This placement allowed me to apply classroom knowledge to real-world challenges, gaining professional experience in software development and cloud infrastructure."
                        },
                        {
                            "episode_img": "Images/TUD.png",
                            "episode_name": "Year 4: Advanced Topics in AI, Cloud, and Industry Applications",
                            "episode_description": "The final year of the program involved advanced courses in AI, machine learning, and cloud architecture. I worked on an extensive project while studying courses like Enterprise Applications Development, Applied Machine Learning, and Security for the Cloud and IoT. Electives such as Applied Artificial Intelligence and Deep Learning allowed me to explore cutting-edge technologies. The capstone project and modules in computational theory and user experience design tied together everything I had learned, preparing me for both industry challenges and further specialization in technology-driven fields."
                        }
                    ]
                },
                {
                    "new_popular": "True",
                    "imageSrc": "Images/Hackathon.jpg",
                    "title": "Tallaght Hospital Healthcare Hackathon",
                    "year": "2022",
                    "genres": [
                        "Software Development",
                        "Mobile Application Development",
                        "Healthcare Technology",
                        "Cloud Computing",
                        "Data Security",
                        "Team Leadership",
                        "Agile Methodologies",
                        "Rapid Prototyping"
                    ],
                    "descriptors": [
                        "Collaborative",
                        "Innovative",
                        "Adaptable",
                        "Technically Proficient",
                        "Leadership-Focused",
                        "Communicative",
                        "Results-Oriented",
                        "Fast-Paced",
                        "Problem-Solving",
                        "Team-Oriented"
                    ],
                    "description": "During the 2nd annual Health Hackathon, hosted by TU Dublin and Tallaght University Hospital, I was part of a diverse team that tackled real-world healthcare problems. Our project was a Warfarin Patient App designed for better home monitoring of patients. This 24-hour event was an intensive experience, blending collaboration, creativity, and learning. We received guidance from experts in healthcare, data security, and cloud computing, which helped us shape a patient-centered solution. Our concept was recognized for its practicality and potential for positive impact on patient care. This experience highlighted the importance of teamwork, quick thinking, and applying theoretical knowledge to practical challenges.",
                    "episodes": [
                        {
                            "episode_img": "Images/Hackathon_1.png",
                            "episode_name": "Kickoff and Problem Briefing",
                            "episode_description": "The hackathon kicked off with over 40 students from TU Dublin gathering at the Synergy Centre on the Tallaght campus. The event started with an introduction to the five healthcare challenges set by clinicians from Tallaght University Hospital, followed by insightful sessions on topics like ethics, data privacy, cyber security, and GDPR. These were critical considerations for any healthcare solution we were about to develop. Afterward, we had one-on-one time with each clinician to dive deeper into the specific problems and gather detailed requirements. This session allowed our team to gain a clear understanding of the issues at hand, which was essential before we moved into ideation."
                        },
                        {
                            "episode_img": "Images/Hackathon_2.png",
                            "episode_name": "Idea Development and Fast Prototyping",
                            "episode_description": "After the briefings, our team immediately got to work brainstorming potential solutions. We explored multiple concepts, considering their feasibility, technical requirements, and potential impact on patient care. Through discussion and collaboration, we decided to focus on developing a Warfarin Patient App to help patients monitor their medication at home. The app would provide a simple, patient-friendly interface for tracking dosage, reminders, and medical data, with the goal of improving patient outcomes and reducing hospital visits. We spent the night conducting research, creating wireframes, and leveraging fast prototyping methods using cloud services, as demonstrated earlier by TU Dublin’s technical presentation. This phase was both intense and rewarding as we iterated through ideas and refined our approach, ready to present the next day."
                        },
                        {
                            "episode_img": "Images/Hackathon_3.png",
                            "episode_name": "Finalizing the Solution and Presentation",
                            "episode_description": "With the concept solidified, the focus shifted to execution. We split tasks among the team, with some members working on building a prototype interface while others concentrated on preparing the presentation materials. We developed a working prototype that showcased the core features of the Warfarin Patient App, including real-time tracking, notifications, and an easy-to-use interface. Additionally, we created a detailed poster that visually explained our solution, from the problem statement and research insights to the proposed features and benefits. After hours of polishing both the prototype and the presentation, we presented our solution to a panel of judges, explaining how it directly addresses the needs of patients and healthcare providers. The judges were impressed with our clear, patient-centric approach and the potential impact of the solution."
                        },
                        {
                            "episode_img": "Images/Hackathon_4.jpg",
                            "episode_name": "Award Ceremony and Reflections",
                            "episode_description": "The hackathon concluded with an award ceremony where our team was announced as the first-place winners. Our Warfarin Patient App was praised for being 'applicable, relevant, patient-centered, and something that could be implemented in real-world healthcare settings.' The experience of working through the night, overcoming challenges, and collaborating under pressure was immensely valuable. We gained practical insights into the healthcare industry, learned the importance of rapid prototyping, and developed solutions that could genuinely make a difference in patient care. The event not only highlighted the importance of teamwork and quick thinking but also fostered lasting relationships with clinicians, industry experts, and our fellow participants. The recognition was the perfect capstone to an intense but rewarding 24 hours, and we left the event inspired to continue exploring healthcare technology solutions in the future."
                        }
                    ]
                },
                {
                    "new_popular": "False",
                    "imageSrc": "Images/nvidia.png",
                    "title": "Nvidia Certificate in Fundamentals of Deep Learning",
                    "year": "2023",
                    "genres": [
                        "Artificial Intelligence",
                        "Deep Learning",
                        "Neural Networks",
                        "Computer Vision",
                        "Natural Language Processing",
                        "Data Science",
                        "Technical Certification"
                    ],
                    "descriptors": [
                        "Hands-On",
                        "Innovative",
                        "Insightful",
                        "Cutting-Edge",
                        "Technical",
                        "Comprehensive",
                        "Educational",
                        "Skill-Building"
                    ],
                    "description": "Completed the 'Fundamentals of Deep Learning' course by Nvidia, focusing on deep learning mechanisms, data augmentation, transfer learning, and real-world AI applications."
                },
                {
                    "new_popular": "False",
                    "imageSrc": "Images/HCAIM.jpg",
                    "title": "Blended IP Week at HCAIM",
                    "year": "2023",
                    "genres": [
                        "Artificial Intelligence",
                        "Ethics",
                        "Problem Solving",
                        "Data Bias",
                        "Collaborative Learning",
                        "Research Presentation"
                    ],
                    "descriptors": [
                        "Collaborative",
                        "Interactive",
                        "Research-Driven",
                        "Ethically Focused",
                        "Insightful",
                        "Thought-Provoking",
                        "Educational",
                        "Engaging"
                    ],
                    "description": "Participated in the HCAIM Erasmus+ Blended Intensive Programme, gaining practical experience in AI ethics, data bias analysis, and presenting AI solutions.",
                    "episodes": [
                        {
                            "episode_img": "Images/HCAIM.jpg",
                            "episode_name": "Program Introduction",
                            "episode_description": "The program began with introductory sessions led by industry professionals and academics, setting the stage for problem-solving exercises focused on AI ethics and bias."
                        },
                        {
                            "episode_img": "Images/HCAIM.jpg",
                            "episode_name": "Group Projects and Discussions",
                            "episode_description": "Throughout the week, I collaborated with peers to develop research proposals and solutions, addressing challenges related to data bias and ethical AI implementations."
                        },
                        {
                            "episode_img": "Images/HCAIM.jpg",
                            "episode_name": "Poster Presentations and Feedback",
                            "episode_description": "Our group presented a detailed poster summarizing our findings and proposed solutions, receiving valuable feedback from experts that helped refine our approach."
                        },
                        {
                            "episode_img": "Images/HCAIM.jpg",
                            "episode_name": "Program Conclusion and Takeaways",
                            "episode_description": "The program concluded with reflections on the importance of ethical considerations in AI. I left with enhanced knowledge and a stronger understanding of AI’s societal impacts."
                        }
                    ]
                }
            ]
        },
        {
            "id": "projects",
            "type": "content-row",
            "title": "Projects",
            "items": [
                {
                    "new_popular": "False",
                    "imageSrc": "Images/Mockflix.png",
                    "title": "Mockflix Portfolio",
                    "year": "2023",
                    "genres": [
                        "Web Development",
                        "Front-End Design",
                        "Interactive Media",
                        "Creative Showcase",
                        "User Experience"
                    ],
                    "descriptors": [
                        "Innovative",
                        "Engaging",
                        "User-Friendly",
                        "Visually Appealing",
                        "Interactive",
                        "Creative"
                    ],
                    "description": "Developed a portfolio project styled like a streaming platform to showcase completed works.",
                    "episodes": [
                        {
                            "episode_img": "Images/Mockflix.png",
                            "episode_name": "Concept and Design",
                            "episode_description": "The project started with the idea of creating a portfolio styled like a streaming platform, allowing for a unique presentation of my completed works."
                        },
                        {
                            "episode_img": "Images/Mockflix.png",
                            "episode_name": "Development Process",
                            "episode_description": "Using HTML, CSS, and JavaScript, I built the platform, focusing on a user-friendly interface that mimics the navigation and layout of popular streaming services."
                        },
                        {
                            "episode_img": "Images/Mockflix.png",
                            "episode_name": "Integrating Projects and Features",
                            "episode_description": "I integrated my projects into the portfolio, adding interactive elements like search functionality and dynamic content filtering to enhance the user experience."
                        },
                        {
                            "episode_img": "Images/Mockflix.png",
                            "episode_name": "Final Deployment and Future Updates",
                            "episode_description": "The portfolio was deployed and shared across professional networks. Future updates include additional projects and refined user experience based on feedback."
                        }
                    ]
                },
                {
                    "new_popular": "True",
                    "imageSrc": "Images/Minifig.jpg",
                    "title": "Minifig Collector",
                    "year": "2023",
                    "genres": [
                        "Web Development",
                        "Data Management",
                        "Collection Management",
                        "User Interface Design",
                        "Hobby Projects"
                    ],
                    "descriptors": [
                        "Engaging",
                        "User-Friendly",
                        "Data-Driven",
                        "Interactive",
                        "Innovative",
                        "Customizable"
                    ],
                    "description": "A collaborative project aimed at managing and organizing a digital LEGO minifigure collection with a focus on user-friendly design and efficient data management. Developed using React, JavaScript, and PHP.",
                    "episodes": [
                        {
                            "episode_img": "Images/Minifig.jpg",
                            "episode_name": "Project Concept and Initial Development",
                            "episode_description": "The project began as a collaborative effort between a friend and me to create a platform for managing LEGO minifigure collections. My friend focused on the styling, while I handled the development using React and JavaScript, starting with the integration of the Rebrickable API to fetch and display basic minifigure data."
                        },
                        {
                            "episode_img": "Images/Minifig.jpg",
                            "episode_name": "Enhancing Functionality with Search and Data Grouping",
                            "episode_description": "To improve usability, I implemented features like search functionality and the ability to group minifigures by sets. These enhancements, built using JavaScript, allowed users to easily navigate their collections and find specific minifigures quickly."
                        },
                        {
                            "episode_img": "Images/Minifig.jpg",
                            "episode_name": "Advanced Data Integration and Backend Optimization",
                            "episode_description": "I reverse-engineered the Rebrickable app to access an undocumented API for retrieving minifigure prices. Additionally, I developed a simple PHP backend to store minifigure data, reducing reliance on external APIs and significantly improving load times. Automated scripts were created to fetch data and prices efficiently, ensuring the platform could handle large collections smoothly."
                        }
                    ]
                },
                {
                    "new_popular": "False",
                    "imageSrc": "Images/AgileMate.jpg",
                    "title": "Agile Mate",
                    "year": "2023",
                    "genres": [
                        "Mobile Application Development",
                        "Agile Project Management",
                        "Collaboration Tools",
                        "Productivity Software",
                        "Software Development"
                    ],
                    "descriptors": [
                        "Innovative",
                        "Efficient",
                        "Team-Oriented",
                        "Productivity-Boosting",
                        "Collaborative",
                        "Time-Saving"
                    ],
                    "description": "Developed Agile Mate, an app designed to notify users of critical issues in Jira and facilitate casual discussion for problem-solving.",
                    "episodes": [
                        {
                            "episode_img": "Images/AgileMate.jpg",
                            "episode_name": "Identifying the Problem",
                            "episode_description": "The project began with identifying a common challenge in software development: quickly addressing critical issues in Jira without disrupting team flow."
                        },
                        {
                            "episode_img": "Images/AgileMate.jpg",
                            "episode_name": "Building the Solution",
                            "episode_description": "Using React Native, Jira SDK, and Firebase, I developed a mobile app that integrates seamlessly with Jira, providing real-time notifications and easy access to discussions."
                        },
                        {
                            "episode_img": "Images/AgileMate.jpg",
                            "episode_name": "User Experience and Design",
                            "episode_description": "The app was designed with a focus on user experience, ensuring that key information is easily accessible on mobile screens without overwhelming the user."
                        },
                        {
                            "episode_img": "Images/AgileMate.jpg",
                            "episode_name": "Launch and Future Improvements",
                            "episode_description": "The app was deployed and tested in a live environment, with plans for future enhancements such as additional integrations and customizable notification settings."
                        }
                    ]
                }
            ]
        },
        {
            "id": "jobs",
            "type": "content-row",
            "title": "Jobs",
            "items": [
                {
                    "new_popular": "True",
                    "imageSrc": "Images/DSP.png",
                    "title": "Executive Officer (Feb 2022 - Jul 2022)",
                    "year": "2022",
                    "genres": [
                        "Web Development",
                        "User Experience Design",
                        "Government Services",
                        "Public Sector IT",
                        "Software Engineering"
                    ],
                    "descriptors": [
                        "Detail-Oriented",
                        "User-Centric",
                        "Adaptable",
                        "Collaborative",
                        "Impactful",
                        "Technical",
                        "Service-Oriented",
                        "Innovative"
                    ],
                    "description": "During my internship at the Department of Social Protection, I played a key role in enhancing the user experience and functionality of two major web platforms, MyWelfare and MyGovID. I began with an intensive training program that provided a solid foundation in government operations, followed by joining the MyWelfare development team. My responsibilities included implementing accessibility improvements, developing new features within the ASP.NET MVC framework, and ensuring seamless integration with SQL databases. I also contributed to automated unit testing and bug resolution, which significantly improved system reliability and user satisfaction. Through effective collaboration with a diverse team, I helped achieve key milestones and successfully deployed enhancements that greatly improved the platforms' usability and accessibility. This internship was a pivotal experience, deepening my technical skills and understanding of the vital role technology plays in public service delivery.",
                    "episodes": [
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "General Training and Government Overview",
                            "episode_description": "The initial phase of my internship involved an intensive two-week training program that introduced me to the operations of the Irish government, with a particular focus on the Department of Social Protection. This training was crucial in providing me with the foundational knowledge necessary to understand the broader context in which MyWelfare and MyGovID operate. I learned about government policies, citizen service standards, and the critical role of technology in public service delivery."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Joining the MyWelfare Development Team",
                            "episode_description": "Following the training, I joined the MyWelfare development team where I was immediately involved in ongoing projects. My role included analyzing existing system functionalities and identifying areas for improvement. I quickly became familiar with the ASP.NET MVC framework and the Azure cloud environment, which are integral to the platforms' architecture. This period was marked by a steep learning curve as I adapted to the fast-paced environment and began contributing to real-time development tasks."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Understanding Project Requirements and User Experience",
                            "episode_description": "My first project involved making simple UI adjustments focused on improving accessibility for blind and disabled users on the MyWelfare and MyGovID platforms. This task allowed me to get more comfortable with ASP.NET MVC, as I worked extensively within this framework to implement the changes. Additionally, it helped me become familiar with the overall layout and structure of the site, which was crucial for my subsequent work on more complex features. Through this project, I gained valuable experience in ensuring that the platforms were accessible and user-friendly for all users."
                        },                        
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Feature Development and SQL Database Utilization",
                            "episode_description": "My role expanded to include hands-on development, where I contributed to building new features that improved user interactions and service accessibility. During this time, I worked with SQL databases to support these new features, ensuring that data was retrieved and utilized efficiently within the platform.My experience with SQL was integral to ensuring that the new functionalities were seamlessly integrated with the existing data structures."
                        },                        
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Automated Unit Testing and Code Quality Assurance",
                            "episode_description": "To ensure the reliability of new and existing features, I participated in the development and execution of automated unit tests. This experience was instrumental in maintaining high code quality and reducing the likelihood of post-deployment issues. I worked closely with senior developers to implement testing frameworks that provided comprehensive coverage and allowed for more efficient debugging and maintenance."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Bug Identification and Resolution",
                            "episode_description": "In addition to feature development, I played a key role in identifying and resolving bugs within the platforms. This involved detailed code reviews, user feedback analysis, and collaboration with the QA team. My efforts in this area helped to significantly reduce system downtimes and improve the overall user experience, ensuring that the platforms could reliably serve the needs of citizens."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Collaboration and Milestone Achievement",
                            "episode_description": "Throughout the internship, I worked closely with a diverse team of developers, designers, and project managers. I contributed to regular team meetings, where we discussed progress, shared insights, and planned upcoming sprints. My ability to communicate effectively and work collaboratively was crucial in meeting key project milestones, particularly under tight deadlines."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Final Deployment and User Experience Enhancements",
                            "episode_description": "The internship culminated in the successful deployment of several key features that I had helped develop and test. These enhancements were aimed at improving the user interface and accessibility of the MyWelfare and MyGovID platforms. The positive feedback from users and the successful reduction in user-reported issues were testament to the impact of my contributions. This experience not only solidified my technical skills but also deepened my understanding of the critical role of technology in public service delivery."
                        },
                        {
                            "episode_img": "Images/DSP.png",
                            "episode_name": "Reflection and Professional Growth",
                            "episode_description": "Reflecting on my time at the Department of Social Protection, I can confidently say that this internship was a pivotal moment in my professional development. I gained hands-on experience in web development, user experience design, and project management within a government setting. The skills and knowledge I acquired during this period have laid a strong foundation for my future career in software development, particularly in roles that require both technical expertise and a deep understanding of user needs."
                        }
                    ]
                },
                {
                    "new_popular": "True",
                    "imageSrc": "Images/Expedia.png",
                    "title": "Tier II Integration Specialist (Nov 2023 - Present)",
                    "year": "2023",
                    "genres": [
                        "API Integration",
                        "Technical Support",
                        "Troubleshooting",
                        "Data Analysis",
                        "Customer Support",
                        "Proactive Monitoring"
                    ],
                    "descriptors": [
                        "Analytical",
                        "Problem-Solver",
                        "Proactive",
                        "Collaborative",
                        "Customer-Focused",
                        "Detail-Oriented",
                        "Mentorship",
                        "Technical Expertise"
                    ],
                    "description": "As a Tier II Integration Specialist at Expedia Group, I contribute to the seamless operation of API integrations and customer support services for enterprise property managers and software partners. My role includes resolving complex technical issues, driving product improvements, and leveraging data analysis for strategic decision-making. Working in a Remote capacity from Dublin, I combine technical expertise with proactive monitoring and collaboration to deliver high-quality solutions that enhance the customer experience. This position has allowed me to deepen my skills in API troubleshooting, data-driven problem solving, and team mentorship.",
                    "episodes": [
                        {
                            "episode_img": "Images/Expedia_1.png",
                            "episode_name": "General Training and Onboarding",
                            "episode_description": "My journey at Expedia Group began with comprehensive onboarding, where I familiarized myself with the company’s API architecture, key tools such as Splunk and Kibana, and the core processes for supporting enterprise partners. This training provided the foundational knowledge required to excel in my role."
                        },
                        {
                            "episode_img": "Images/Expedia_2.jpg",
                            "episode_name": "API Integration Troubleshooting",
                            "episode_description": "A key responsibility in my role is investigating and resolving complex API integration issues. By collaborating with external partners and internal teams, I ensure quick resolutions and minimize service disruptions. This process requires deep technical analysis and effective communication."
                        },
                        {
                            "episode_img": "Images/Expedia_3.png",
                            "episode_name": "Proactive Monitoring and Issue Prevention",
                            "episode_description": "To prevent potential service disruptions, I conduct proactive system monitoring using tools like Splunk and Kibana. This involves analyzing system logs and setting up internal alerts, enabling the team to address issues before they impact customers."
                        },
                        {
                            "episode_img": "Images/Expedia_4.jpg",
                            "episode_name": "Bug Investigation and Reporting",
                            "episode_description": "When technical issues arise, I lead thorough investigations, report bugs to development teams, and follow up to ensure timely resolutions. This process involves meticulous analysis and collaboration across departments to maintain high system reliability."
                        },
                        {
                            "episode_img": "Images/Expedia_5.png",
                            "episode_name": "Customer Support Excellence",
                            "episode_description": "Delivering exceptional support to enterprise property managers and software partners is a priority. By addressing their technical concerns and providing tailored solutions, I consistently achieve high customer satisfaction scores."
                        },
                        {
                            "episode_img": "Images/Expedia_6.png",
                            "episode_name": "Team Training and Mentorship",
                            "episode_description": "I actively contribute to the growth of the team by providing training sessions and mentorship to both internal team members and external partners. This includes sharing best practices, guiding through complex integrations, and promoting a culture of continuous learning."
                        }
                    ]
                }
            ]
        }
    ],
    "Hero" : [
        {
            "new_popular": "True",
            "imageSrc": "Images/Csanad_1.jpg",
            "title": "Csanad Alattyanyi",
            "year":"2001", 
            "genres": [
                        "Web Development",
                        "User Experience Design",
                        "Government Services",
                        "Public Sector IT",
                        "Software Engineering"
            ],
            "descriptors": [
                "Detail-Oriented",
                "User-Centric",
                "Adaptable",
                "Collaborative",
                "Impactful",
                "Technical",
                "Service-Oriented",
                "Innovative"
            ],
            "description": "I am a Junior Full Stack Developer with a passion for exploring complex logic systems and solving challenging problems. My journey into programming began with automating tasks in games using AutoHotKey (AHK), which naturally led to a self-taught progression into Python, JavaScript, and other programming languages. Since then, I’ve honed my skills both through formal education and personal projects.<br><br>I hold a BSc (Honours) in Information Technology from Technological University Dublin, where I specialized in software development. During my studies, I gained hands-on experience with technologies like JavaScript, Python, C#, SQL, and ASP.NET MVC. I’m particularly comfortable with front-end development using JavaScript, HTML/CSS, and React, but I’m now transitioning into full-stack development with a growing interest in back-end technologies like Node.js and SQL.<br><br>My technical background is complemented by real-world experience, including a role as a Tier 2 Integration Support at Expedia, where I worked on troubleshooting and resolving integration issues. I also completed an internship at the Department of Social Protection, contributing to the development and testing of features for the MyWelfare and MyGovID platforms. In this role, I improved the user experience by implementing accessibility features and writing automated unit tests to ensure system reliability. Outside of formal work, I love building side projects and experimenting with new technologies.<br><br>What drives me is the opportunity to combine creativity with problem-solving, and I thrive when exploring interesting, non-standard approaches to technical challenges. If you're looking for a developer who is adaptable, curious, and committed to building efficient, creative solutions, I'd love to connect and explore opportunities to collaborate."
        }
    ]
}
